In [831]:
import pandas as pd

In [832]:
df= pd.read_excel("data-raw/nyc.xlsx")
df

       Period  Value
0    Jan-2016  17453
1    Feb-2016  16828
2    Mar-2016  16547
3    Apr-2016  17066
4    May-2016  18114
..        ...    ...
107  Dec-2024  25669
108  Jan-2025  21497
109  Feb-2025  23729
110  Mar-2025  24716
111  Apr-2025  24699

[112 rows x 2 columns]

In [833]:
## reformatting the dataframe
pd.options.display.float_format = '{:,.0f}'.format

In [834]:
## understand data better
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112 entries, 0 to 111
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Period  112 non-null    object
 1   Value   112 non-null    int64
dtypes: int64(1), object(1)
memory usage: 1.9+ KB

In [835]:
## summary of dataset and description of distribution
df.describe()

       Value
count    112
mean  21,792
std    3,898
min   12,122
25%   18,634
50%   22,447
75%   25,106
max   29,776

## CLEANING DATA

In [837]:
## one-based indexing so the data starts at 1, not 0. I used Anaconda for this because I couldn't figure out how to do it in the notes.
business_applications = df.reset_index(drop=True).rename(index=lambda x: x + 1)
business_applications

       Period  Value
1    Jan-2016  17453
2    Feb-2016  16828
3    Mar-2016  16547
4    Apr-2016  17066
5    May-2016  18114
..        ...    ...
108  Dec-2024  25669
109  Jan-2025  21497
110  Feb-2025  23729
111  Mar-2025  24716
112  Apr-2025  24699

[112 rows x 2 columns]

In [838]:
# Convert the 'Period' column to datetime using pandas so it registers the column as a date, not a string. I did need a refresher on how to do this and used Anaconda.
business_applications['Period'] = pd.to_datetime(business_applications['Period'], format='%b-%Y')

In [839]:
# sort values in descending order by the 'Period' column, since I will be working with the latest data first.
business_applications.sort_values(by= "Period", ascending= False)

        Period  Value
112 2025-04-01  24699
111 2025-03-01  24716
110 2025-02-01  23729
109 2025-01-01  21497
108 2024-12-01  25669
..         ...    ...
5   2016-05-01  18114
4   2016-04-01  17066
3   2016-03-01  16547
2   2016-02-01  16828
1   2016-01-01  17453

[112 rows x 2 columns]

In [840]:
## group by year so that I can do percentage change calculations
# business_applications.groupby("groupby-datetime")['Period']

In [841]:
business_applications['Year'] = business_applications['Period'].dt.year

In [842]:
business_applications['Month'] = business_applications['Period'].dt.month

In [843]:
# Pivot the data
business_applications = business_applications.pivot(index='Month', columns='Year', values='Value')

In [844]:
# Sort rows by month (just in case)
pivot = pivot.sort_index()

In [845]:
business_applications

Year    2016   2017   2018   2019   2020   2021   2022   2023   2024   2025
Month
1     17,453 17,166 19,007 17,032 17,565 27,965 28,337 24,006 25,980 21,497
2     16,828 17,295 18,825 19,465 19,522 24,374 25,371 25,438 24,594 23,729
3     16,547 17,707 18,686 19,705 15,580 25,710 25,170 26,376 23,721 24,716
4     17,066 17,732 18,650 19,810 12,122 28,797 24,506 25,295 24,540 24,699
5     18,114 17,945 19,142 19,111 15,426 27,117 24,782 25,404 24,232    NaN
6     14,718 18,588 19,167 19,526 20,748 24,706 23,803 27,108 24,437    NaN
7     18,070 18,251 19,374 18,759 29,776 25,381 24,638 27,228 23,978    NaN
8     16,651 18,336 18,805 18,862 28,888 25,196 24,305 26,921 23,991    NaN
9     17,711 17,778 18,965 19,302 26,450 24,557 25,084 26,152 23,913    NaN
10    16,180 18,088 19,103 19,015 24,590 25,776 24,151 26,753 23,397    NaN
11    17,037 18,691 18,776 19,224 23,453 25,298 24,039 26,832 23,726    NaN
12    17,721 17,901 19,181 20,087 20,281 26,126 23,820 25,762 25,669    NaN

## ANALYZING DATA

In [876]:
# I want to work specifically with YOY data for April of this year and last year.
##I am going to create a new dataframe that holds 2023-2025 data to be safe. 

df1=business_applications.loc[:, 2023:2025]
df1

Year    2023   2024   2025
Month
1     24,006 25,980 21,497
2     25,438 24,594 23,729
3     26,376 23,721 24,716
4     25,295 24,540 24,699
5     25,404 24,232    NaN
6     27,108 24,437    NaN
7     27,228 23,978    NaN
8     26,921 23,991    NaN
9     26,152 23,913    NaN
10    26,753 23,397    NaN
11    26,832 23,726    NaN
12    25,762 25,669    NaN

In [848]:
#find YOY percentage change of business applications in NYC from April 2025 to April 2024

In [849]:
## create function

def pct_chg(old_number, new_number):
    return round((new_number - old_number) / old_number * 100,1)

In [850]:
## do i need to group by years so that i can do a horizontal analysis?

In [851]:
## apply function using lamba to create new col called "yoy_pct_chg"
# df['yoy_pct_chg'] = df.apply(lambda x: x['column1'] + x['column2'], axis = 1)

In [852]:
## find YOY percentage change of business applications in NYC from March 2025 to March 2024

In [853]:
# business_applications['Percentage Change']= business_applications['Value'].pct_change() *100